app/controllers/eventmedias_controller.rb

  def index
    @eventmedias = Eventmedia.all
---
SELECT * FROM "eventmedias"