app/controllers/eventdatas_controller.rb

SELECT * FROM "eventdatas"
---
  def index
    @eventdatas = Eventdata.all