app/controllers/users_controller.rb

			render(:action => :signin)
			return
		end
		match = User.find_by_email(@user.email)
---
SELECT * FROM "users" WHERE ("users"."email" = 'athakur@stanford.edu') LIMIT 1

			render(:action => :signin)
			return
		end
		match = User.find_by_userid(@user.userid)
---
SELECT "users".id FROM "users" WHERE ("users"."userid" = 'amrita') LIMIT 1

			render(:action => :signin)
		else
			@user.password = Digest::SHA1.hexdigest(@password)
			if @user.save
---
INSERT INTO "users" ("name", "dob", "created_at", "updated_at", "date_modified", "userid", "date_added", "password", "email") VALUES('Amrita Thakur', '1978-12-26', '2010-07-02 22:53:22', '2010-07-02 22:53:22', '2010-07-02 22:53:22', 'amrita', '2010-07-02 22:53:22', 'e852d232a20b71dd9e90e6e2c44a551a89f65a5e', 'thakur.amrita@gmail.com')

  def post_register_signin
	  flash[:signup_notice] = nil
		flash[:signin_notice] = nil
		flash.keep(:url)

		@user = User.find_by_userid(params[:user][:userid])
---
SELECT * FROM "users" WHERE ("users"."userid" = 'amrita') LIMIT 1

  def index
	  if (session["timeline_id"] != 'amrita')
		  redirect_to("/")
			return
		end

    @users = User.all
---
SELECT * FROM "users"

  def show

		#HACK
		if (params[:id] == "post_register_signin")
			post_register_signin
			return
		end

    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."userid" = 'amrita') LIMIT 1

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("dob", "created_at", "updated_at", "lastname", "userid", "firstname", "password", "parentemail", "email", "parentname") VALUES('2010-06-24', '2010-06-24 20:50:05', '2010-06-24 20:50:05', 'Thakur', 'amrita', 'Amrita', 'amrita', 'asgdkagsh@ashkdhjska.com', 'athakur@stanford.edu', 'anjan')